Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
        <device Dname="CY8C6136FTI-F42">
          <compile define="CY8C6136FTI_F42" />
        </device>
      </subFamily>
      <!-- PSoC 61, CY8C61x7 -->
      <subFamily DsubFamily="CY8C61x7">
        <debug Pname="Cortex-M4" svd="SVD/psoc6_01.svd" />
        <debugvars configfile="Debug/CY8C6xx7.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 1;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40010CD8;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40010800;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40010400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x07;               // 1M devices have 8 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000000FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000008;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V1
          __var hsiomPrt7PortSel0Addr = 0x40310070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40310090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403203A8;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403204A8;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403203B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403204B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00048000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00100000" default="1" startup="1" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx7.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx7_sect256KB.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C6117BZI-F34">
          <compile define="CY8C6117BZI_F34" />
        </device>
        <device Dname="CY8C6117FDI-F02">
          <compile define="CY8C6117FDI_F02" />
        </device>
        <device Dname="CY8C6117WI-F34">
          <compile define="CY8C6117WI_F34" />
        </device>
        <device Dname="CY8C6137BZI-F14">
          <compile define="CY8C6137BZI_F14" />
        </device>
        <device Dname="CY8C6137BZI-F34">
          <compile define="CY8C6137BZI_F34" />
        </device>
        <device Dname="CY8C6137BZI-F54">
          <compile define="CY8C6137BZI_F54" />
        </device>
        <device Dname="CY8C6137FDI-F02">
          <compile define="CY8C6137FDI_F02" />
        </device>
        <device Dname="CY8C6137WI-F54">
          <compile define="CY8C6137WI_F54" />
        </device>
      </subFamily>
      <!-- PSoC 61, CY8C61x8 -->
      <subFamily DsubFamily="CY8C61x8">
        <debug Pname="Cortex-M4" svd="SVD/psoc6_02.svd" />
        <debugvars configfile="Debug/CY8C6xxA.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 2;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40000CC8;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40001000;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40000400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x07;               // 2M devices have 8 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000003FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000010;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V2
          __var hsiomPrt7PortSel0Addr = 0x40300070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40300090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403103C4;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403104C4;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403103CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403104CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00080000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00100000" default="1" startup="1" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx8.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx8_sect256KB.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C6148AZI-S2F44">
          <compile define="CY8C6148AZI_S2F44" />
        </device>
        <device Dname="CY8C6148BZI-S2F44">
          <compile define="CY8C6148BZI_S2F44" />
        </device>
        <device Dname="CY8C6148FNI-S2F43">
          <compile define="CY8C6148FNI_S2F43" />
        </device>
        <device Dname="CY8C6148LQI-S2F02">
          <compile define="CY8C6148LQI_S2F02" />
        </device>
        <device Dname="CY8C6148LQI-S2F42">
          <compile define="CY8C6148LQI_S2F42" />
        </device>
      </subFamily>
      <!-- PSoC 61, CY8C61xA -->
      <subFamily DsubFamily="CY8C61xA">
        <debug Pname="Cortex-M4" svd="SVD/psoc6_02.svd" />
        <debugvars configfile="Debug/CY8C6xxA.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 2;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40000CC8;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40001000;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40000400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x07;               // 2M devices have 8 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000003FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000010;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V2
          __var hsiomPrt7PortSel0Addr = 0x40300070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40300090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403103C4;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403104C4;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403103CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403104CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00100000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00200000" default="1" startup="1" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA.FLM" start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_sect256KB.FLM" start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C614AAZI-S2F04">
          <compile define="CY8C614AAZI_S2F04" />
        </device>
