Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
        <device Dname="CY8C614AAZI-S2F14">
          <compile define="CY8C614AAZI_S2F14" />
        </device>
        <device Dname="CY8C614AAZI-S2F44">
          <compile define="CY8C614AAZI_S2F44" />
        </device>
        <device Dname="CY8C614ABZI-S2F04">
          <compile define="CY8C614ABZI_S2F04" />
        </device>
        <device Dname="CY8C614ABZI-S2F44">
          <compile define="CY8C614ABZI_S2F44" />
        </device>
        <device Dname="CY8C614AFNI-S2F03">
          <compile define="CY8C614AFNI_S2F03" />
        </device>
        <device Dname="CY8C614AFNI-S2F43">
          <compile define="CY8C614AFNI_S2F43" />
        </device>
        <device Dname="CY8C614ALQI-S2F02">
          <compile define="CY8C614ALQI_S2F02" />
        </device>
        <device Dname="CY8C614ALQI-S2F42">
          <compile define="CY8C614ALQI_S2F42" />
        </device>
      </subFamily>
    </family>
    <!-- PSoC 62 -->
    <family Dfamily="PSoC 62" Dvendor="Infineon:7">
      <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="100000000" />
      <processor Pname="Cortex-M4" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="150000000" />
      <description>PSoC 62 (Performance Line): Dual-core Cortex-M4/M0+ MCU series with programmable digital and analog peripherals, advanced graphics, CapSense, crypto and secure boot security.</description>
      <book name="README.txt" title="Infineon PSoC 6 DFP user guide" />
      <book name="known_issues.txt" title="Infineon PSoC 6 DFP known issues" />
      <debug Pname="Cortex-M0p" __ap="1" defaultResetSequence="ResetProcessor" />
      <debug Pname="Cortex-M4" __ap="2" defaultResetSequence="ResetSystem">
        <datapatch address="0xE008EFE0" value="0x000000A1" info="this is Cortex-M4 TPIU, not Cortex-M3 TPIU. Debuggers may determine by this that TPIU supports Half-Frame Syncs." />
      </debug>
      <sequences>
        <sequence name="DAP_Handshake">
          <!-- DAP_Handshake: Execute initial handshake sequence depend on selected protocol -->
          <block>
            __var isSWJ      = ((__protocol &amp; 0x00010000) != 0);
            __var protType   = __protocol &amp; 0x0000FFFF;
            __var DPIDR = 0;
            __Result = 0;
          </block>
          <!-- JTAG Protocol -->
          <control if="protType == 1">
            <control if="isSWJ">
              <block atomic="true">
                // Ensure current debug interface is in reset state
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                // Execute SWJ-DP Switch Sequence SWD to JTAG (0xE73C)
                // Change if SWJ-DP uses deprecated switch code (0xAEAE)
                DAP_SWJ_Sequence(16, 0xE73C);
              </block>
            </control>
            <block atomic="true">
              // JTAG "Soft" Reset
              DAP_JTAG_Sequence(6, 1, 0x00);                        // Test-Logic-Reset
              // Get IDCODE to make shure that JTAG-DP is available
              DAP_JTAG_Sequence(4, 0, 0x00);                        // 4*Run-Test/Idle
              DAP_JTAG_Sequence(2, 1, 0x00);                        // ~ Select-DR ~ Select-IR
              DAP_JTAG_Sequence(2, 0, 0x00);                        // ~ Capture-IR ~ Shift-IR
              DAP_JTAG_Sequence(8, 0, 0xFE);                        // Shift-IR (IDCODE BYPASS)
              DAP_JTAG_Sequence(5, 1, 0x00);                        // ~ Exit1-IR (IDCODE BYPASS) ~ Update-IR ~ Test-Logic-Reset
              DAP_JTAG_Sequence(4, 0, 0x00);                        // Make sure that we go through Idle state in TAP controller
              DAP_JTAG_Sequence(1, 1, 0x00);                        // Select-DR
              DAP_JTAG_Sequence(2, 0, 0x00);                        // ~ Capture-DR ~ Shift-DR
              DPIDR = DAP_JTAG_Sequence(33, 0, 0x00000000);         // Shift 33-bits data
              DAP_JTAG_Sequence(5, 1, 0x00);                        // ~ Exit1-DR ~ Update-DR ~ ~ Select-DR ~ Select-IR ~ Test-Logic-Reset
              DAP_JTAG_Sequence(4, 0, 0x00);                        // Make sure that we go through Idle state in TAP controller
            </block>
          </control>
          <!-- SWD Protocol -->
          <control if="protType == 2">
            <control if="isSWJ">
              <block atomic="true">
                // Ensure current debug interface is in reset state
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                // Execute SWJ-DP Switch Sequence JTAG to SWD (0xE79E)
                // Change if SWJ-DP uses deprecated switch code (0xEDB6)
                DAP_SWJ_Sequence(16, 0xE79E);
                // Enter SWD Line Reset State
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF); // More than 50 cycles SWDIO/TMS High
                DAP_SWJ_Sequence(3,  0x00);               // At least 2 idle cycles (SWDIO/TMS Low)
              </block>
            </control>
            <control if="!isSWJ">
              <block atomic="true">
                // Enter SWD Line Reset State
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF); // More than 50 cycles SWDIO/TMS High
                DAP_SWJ_Sequence(3,  0x00);               // At least 2 idle cycles (SWDIO/TMS Low)
              </block>
            </control>
            <block>
              DPIDR = ReadDP(0x0); // Read DPIDR to enable SWD interface (SW-DPv1 and SW-DPv2)
            </block>
          </control>
          <control if="(DPIDR &amp; 0xFFF00FFF) != 0x6BA00477">
            <block>
              __Result = -1; // DAP is unavailable
            </block>
          </control>
        </sequence>
        <sequence name="DAP_poll">
          <!-- DAP_poll: Poll the DAP until it becomes available -->
          <block>
            __Result = -1; // Assume DAP is not available yet
          </block>
          <control while="__Result != 0" timeout="600000">
            <block>
              sequence("DAP_Handshake"); // Poll DP until bootloader allows access to device (can be up to 600ms)
            </block>
          </control>
          <control if="__Result != 0">
            <block>
              Message(1, "The Debug Access Port is unavailable.");
            </block>
          </control>
        </sequence>
        <sequence name="DebugPortSetup">
          <!-- DebugPortSetup: Prepare the target debug port for connection -->
          <block>
            sequence("DAP_Handshake");
          </block>
          <control if="__Result != 0">
            <!-- In case DAP isn't avalable, execute a system-wide reset via dedicated debugger reset line. -->
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;
              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF); // Deassert nRESET line
            </block>
            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000" />
            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000" />
            </control>
            <control if="!canReadPins">
              <block>
                DAP_SWJ_Pins(nReset, nReset, 0); // Assert nRESET line
              </block>
              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000" />
            </control>
            <block>
              sequence("DAP_poll");
            </block>
          </control>
        </sequence>
        <sequence name="DebugPortStart">
          <!-- DebugPortStart: Connect to the target debug port and power it up -->
          <block info="Read DP CTRL/STAT">
            __var SW_DP_ABORT  = 0x0;
            __var DP_CTRL_STAT = 0x4;
            __var DP_SELECT    = 0x8;
            __var powered_down = 0;
            // Switch to DP Register Bank 0. Explicitly set APSEL to current AP selection
            WriteDP(DP_SELECT, __ap &lt;&lt; 24);
            // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
            powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
          </block>
          <control if="powered_down">
            <block info="Power Up System &amp; Debug">
              // Request Debug/System Power-Up
              // Ignore error here: even there is a polling in the next block, CMSIS-DAP transports reads DP.RDBUFF register
              // right after write to DP.CTRL_STAT. This will fail for some cases - for example if device is waking from DeepSleep.
              __errorcontrol = 1;
              WriteDP(DP_CTRL_STAT, 0x50000000);
              __errorcontrol = 0;
            </block>
            <!-- Wait for Power-Up Request to be acknowledged -->
            <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000" info="Wait for power acknowledged" />
            <!-- CDBGRSTREQ on PSoC6 behaves like Power-On Reset. Not desired when starting the Debug Port
            <block info="Debug Reset">
              __errorcontrol = 1;
              // Request Debug Reset
              WriteDP(DP_CTRL_STAT, 0x54000000);
              // CDBGRSTREQ is equivalent to Power-On Reset and fully reboots the device.
              // Depending on the user application the reboot can take up to 600ms.
              DAP_Delay(600000);
              __errorcontrol = 0;
            </block>
            -->
            <!-- Wait for Debug Reset to be acknowledged, don't issue error on timeout to deal with improperly connected Debug Reset -->
            <!-- <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA8000000) != 0xA8000000" timeout="300000" info="Wait for Debug Reset Acknowledge"/> -->
            <!-- JTAG Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 1">
              <block info="JTAG: Clear Sticky Bits">
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                WriteDP(DP_CTRL_STAT, 0x50000F32);
              </block>
            </control>
            <!-- SWD Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 2">
              <block info="SWD: Init SWD &amp; Clear Sticky Bits">
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                WriteDP(DP_CTRL_STAT, 0x50000F00);
                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                WriteDP(SW_DP_ABORT, 0x0000001E);
              </block>
            </control>
          </control>
          <block>
            Sequence("PrintDeviceInfo"); // Print device info
          </block>
        </sequence>
        <sequence name="ResetHardware">
          <!-- ResetHardware: HW Reset causes a reboot of the device which also resets debug.
               - Using this as a prereset is OK to potentially wake up the system from DeepSleep.
               - Using this in the middle of the debug session will break the connection unless recovery
                 from a connection loss is supported by the debug IDE.
          -->
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF); // Deassert nRESET line
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000" />
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000" />
          </control>
          <control if="!canReadPins">
            <block>
              DAP_SWJ_Pins(nReset, nReset, 0); // Assert nRESET line
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000" />
          </control>
          <block>
            // Give the PSoC6 bootloader time to finish (can be up to 600ms)
            DAP_Delay(600000);
          </block>
        </sequence>
        <sequence name="PrintDeviceInfo">
          <!-- PrintDeviceInfo: Read and print device info -->
          <block>
            __var siId;
            __var siRev;
            __var siFamily;
            __var fbVerHi;
            __var sflashSvnVer;
            __var protection;
            __var v;
            Message(0, "****************************************************");
            // Get Si Id, Family and Rev.
            v = Read32(0x16000000);
            siId = (v &amp; 0xFFFF0000) &gt;&gt; 16;
            siRev = (v &amp; 0x0000FF00) &gt;&gt; 8;
            v = Read32(0x1600000C);
            siFamily = v &amp; 0x00000FFF;
            Message(0, "** Silicon: 0x%04X, Family: 0x%03X, Rev.: 0x%02X", siId, siFamily, siRev);
            // Get FlashBboot verison
            fbVerHi = Read32(0x16002004);
          </block>
          <control if="fbVerHi == 0">
            <block>
              Message(1, "Invalid FlashBoot: High version word of Flash Boot is zero");
            </block>
          </control>
          <control if="fbVerHi != 0">
            <block>
              __var fbVerLo = Read32(0x16002018);
              __var b0 = fbVerHi &gt;&gt; 28;
              __var b1 = (fbVerHi &gt;&gt; 24) &amp; 0x0F;
              __var b2 = (fbVerHi &gt;&gt; 16) &amp; 0xFF;
              __var b3 = fbVerHi &amp; 0x0000FFFF;
            </block>
            <control if="b0 &gt; 2">
              <block>
                Message(1, "Unsupported Flash Boot Version - Flash Boot Version [31:28] = 0x%X", b0);
              </block>
            </control>
            <control if="b0 &lt;= 2">
              <control if="b3 != 0x8001">
                <block>
                  Message(1, "Flash Boot is corrupted or non Flash Boot image programmed");
                </block>
              </control>
              <control if="b3 == 0x8001">
                <control if="b0 == 0">
                  <control if="b1 == 1">
                    <block>
                      Message(0, "** Flash Boot version: 1.%02u", b2);
                    </block>
                  </control>
                  <control if="b1 == 2">
                    <control if="b2 &lt; 20">
                      <block>
                        Message(0, "** Flash Boot version: 1.0.0.%u", b2);
                      </block>
                    </control>
                    <control if="(b2 &gt;= 20) &amp;&amp; (b2 &lt; 29)">
                      <block>
                        Message(0, "** Flash Boot version: 1.0.1.%u", b2);
                      </block>
                    </control>
                    <control if="b2 &gt;= 29">
                      <block>
                        Message(0, "** Flash Boot version: 1.20.1.%u", b2);
                      </block>
                    </control>
                  </control>
                </control>
                <control if="b0 == 1">
                  <block>
                    Message(0, "** Flash Boot version: 2.0.0.%u", b2);
                  </block>
                </control>
                <control if="b0 == 2">
                  <block>
                    __var patch = fbVerLo &gt;&gt; 24;
                    __var build = fbVerLo &amp; 0x0000FFFF;
                    Message(0, "** Flash Boot version: %u.%u.%u.%u", b1, b2, patch, build);
                  </block>
                </control>
              </control>
            </control>
          </control>
          <block>
            sflashSvnVer = Read32(0x16000028); // Get SFLASH version
          </block>
          <control if="(sflashSvnVer != 0) &amp;&amp; (sflashSvnVer != 0xFFFFFFFF)">
            <block>
              Message(0, "** SFlash version: %u", sflashSvnVer);
            </block>
          </control>
          <!-- Get life-cycle stage -->
          <control if="siFamily == 0x100">
            <block>
              protection = Read32(0x40210500); // PSoC 6-BLE2 family
            </block>
          </control>
          <control if="siFamily != 0x100">
            <block>
              protection = Read32(0x402020C4); // PSoC 6-2M family
            </block>
          </control>
          <!-- Decode life-cycle stage -->
          <control if="protection == 1">
            <block>
              Message(0, "** Chip Protection: VIRGIN");
            </block>
          </control>
          <control if="protection == 2">
            <block>
              Message(0, "** Chip Protection: NORMAL");
            </block>
          </control>
          <control if="protection == 3">
            <block>
              Message(0, "** Chip Protection: SECURE");
            </block>
          </control>
          <control if="protection == 4">
            <block>
              Message(0, "** Chip Protection: DEAD");
            </block>
          </control>
          <control if="(protection == 0) || (protection &gt; 4)">
            <block>
              Message(0, "** Chip Protection: UNKNOWN");
            </block>
          </control>
          <block>
            Message(0, "****************************************************");
          </block>
        </sequence>
        <sequence name="DebugCoreStart" Pname="Cortex-M4">
          <block>
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            // Enable Core Debug via DHCSR
            Write32(DHCSR_Addr, 0xA05F0001);
          </block>
          <!-- Enable clock to ETM block for proper ETM detection if Parallel Trace Port enabled and it is Debug session -->
          <control if="((__connection &amp; 0x00000001) != 0) &amp;&amp; ((__traceout &amp; 0x00000002) != 0)">
            <block>
              Sequence("SetupTraceClock");
            </block>
          </control>
        </sequence>
        <!-- Configure pins trace pins if Parallel Trace Port enabled -->
        <sequence name="TraceStart" Pname="Cortex-M4">
          <control if="(__traceout &amp; 0x00000002) != 0" info="Parallel Trace Port enabled">
            <block>
              __var tpWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;
            </block>
            <control if="__TPIU_pinlocation == 1" info="CY8CKIT-062-WIFI-BT Like">
              <block>
                sequence("SetupTracePin_P7_0");
                sequence("SetupTracePin_P9_3");
              </block>
              <control if="tpWidth &gt;= 1">
                <block>
                  sequence("SetupTracePin_P7_6");
                </block>
              </control>
              <control if="tpWidth &gt;= 2">
                <block>
                  sequence("SetupTracePin_P7_5");
                  sequence("SetupTracePin_P7_4");
                </block>
              </control>
            </control>
            <control if="__TPIU_pinlocation == 2" info="CY8CKIT-062S2-43012 Like">
              <block>
                sequence("SetupTracePin_P7_0");
                sequence("SetupTracePin_P9_3");
              </block>
              <control if="tpWidth &gt;= 1">
                <block>
                  sequence("SetupTracePin_P9_2");
                </block>
              </control>
              <control if="tpWidth &gt;= 2">
                <block>
                  sequence("SetupTracePin_P9_1");
                  sequence("SetupTracePin_P9_0");
                </block>
              </control>
            </control>
          </control>
        </sequence>
        <sequence name="SetupTraceClock" Pname="Cortex-M4">
          <block>
            __var PERI_CLOCK_CTL_DIV_SEL_MASK = 0x0000000F;    // PERI_CLOCK_CTL.DIV_SEL
            __var PERI_DIV_CMD_ENABLE_MASK = 0x80000000;       // ENABLE field in PERI_DIV_CMD
            __var PERI_DIV_CMD_DISABLE_MASK = 0x40000000;      // DISABLE field in PERI_DIV_CMD
            // Peripheral clock divider index to use for trace clock
            __var ClockDivSel = PERI_CLOCK_CTL_DIV_SEL &amp; PERI_CLOCK_CTL_DIV_SEL_MASK;
            __var ClockDivVal = 0 &amp; PERI_DIV_PA_SEL_MASK;  // Peripheral clock divider value for trace clock
                                                               // Actual divider is (1+ClockDivVal)
            __var ClockCtlVal = Read32(TRACE_CLOCK_CTL_ADDR);
            __var ClockDivCtlVal = Read32(TRACE_CLOCK_DIV_CTL_ADDR + (ClockDivSel * 4));
          </block>
          <control if="(ClockCtlVal != ClockDivSel) || (ClockDivCtlVal != ((ClockDivVal &lt;&lt; PERI_DIV_CMD_PA_SEL_ROL) | 0x1))">
            <block>
              Message(0, "Setup TPIU clock");
              // DISABLE 8.0 DIV in PERI_DIV_CMD:
              __var ClockDivCmd = PERI_DIV_CMD_DISABLE_MASK | (PERI_DIV_PA_SEL_MASK &lt;&lt; PERI_DIV_CMD_PA_SEL_ROL) | ClockDivSel;
              Write32(TRACE_CLOCK_DIV_CMD_ADDR, ClockDivCmd);
              // Use selected divider (8.0) for cpuss.clock_trace_in
              Write32(TRACE_CLOCK_CTL_ADDR, ClockDivSel);
              // Set 8.0 DIV = ClockDivVal
              Write32((TRACE_CLOCK_DIV_CTL_ADDR + (ClockDivSel * 4)), (ClockDivVal &lt;&lt; 8));
              // ENABLE 8.0 DIV
              ClockDivCmd = PERI_DIV_CMD_ENABLE_MASK | (PERI_DIV_PA_SEL_MASK &lt;&lt; PERI_DIV_CMD_PA_SEL_ROL) | ClockDivSel;
              Write32(TRACE_CLOCK_DIV_CMD_ADDR, ClockDivCmd);
            </block>
          </control>
        </sequence>
        <!-- Setup Trace Pin P7_0 as TRACECLK -->
        <sequence name="SetupTracePin_P7_0" Pname="Cortex-M4">
          <block>
            __var pin = 0;                            // Pin number
            __var ioSelVal = 0x1A;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_clock' signal (P7_0)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
