Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx4_sect128KB.FLM" start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C6244AZI-S4D12">
          <compile define="CY8C6244AZI_S4D12" />
        </device>
        <device Dname="CY8C6244AZI-S4D62">
          <compile define="CY8C6244AZI_S4D62" />
        </device>
        <device Dname="CY8C6244AZI-S4D82">
          <compile define="CY8C6244AZI_S4D82" />
        </device>
        <device Dname="CY8C6244AZI-S4D83">
          <compile define="CY8C6244AZI_S4D83" />
        </device>
        <device Dname="CY8C6244AZI-S4D92">
          <compile define="CY8C6244AZI_S4D92" />
        </device>
        <device Dname="CY8C6244AZI-S4D93">
          <compile define="CY8C6244AZI_S4D93" />
        </device>
        <device Dname="CY8C6244AZQ-S4D92">
          <compile define="CY8C6244AZQ_S4D92" />
        </device>
        <device Dname="CY8C6244AZQ-S4D93">
          <compile define="CY8C6244AZQ_S4D93" />
        </device>
        <device Dname="CY8C6244LQI-S4D12">
          <compile define="CY8C6244LQI_S4D12" />
        </device>
        <device Dname="CY8C6244LQI-S4D62">
          <compile define="CY8C6244LQI_S4D62" />
        </device>
        <device Dname="CY8C6244LQI-S4D82">
          <compile define="CY8C6244LQI_S4D82" />
        </device>
        <device Dname="CY8C6244LQI-S4D92">
          <compile define="CY8C6244LQI_S4D92" />
        </device>
        <device Dname="CY8C6244LQQ-S4D92">
          <compile define="CY8C6244LQQ_S4D92" />
        </device>
      </subFamily>
      <!-- PSoC 62, CY8C62x5 -->
      <subFamily DsubFamily="CY8C62x5">
        <debug Pname="Cortex-M0p" svd="SVD/psoc6_03.svd" />
        <debug Pname="Cortex-M4" svd="SVD/psoc6_03.svd" />
        <debugvars configfile="Debug/CY8C6xxA.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 2;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40000C5C;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40001000;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40000400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x03;               // 512K devices have 4 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000003FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000010;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V2
          __var hsiomPrt7PortSel0Addr = 0x40300070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40300090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403103C4;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403104C4;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403103CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403104CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <sequences>
          <sequence name="ResetProcessor" Pname="Cortex-M0p">
            <!-- ResetProcessor: Cortex-M0+ Processor reset via PSoC6 CPU Sub-System Controller. Cortex-M0+ doesn't have VECTRESET. -->
            <block>
              Write32(0x40201000, 0x05FA0000); // Reset CM0+ via "ENABLED" bit in CPUSS_CM0_CTL (M0+ Control Register)
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(0xE000EDF0) &amp; 0x02000000)" timeout="500000" />
          </sequence>
        </sequences>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00040000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00080000" default="1" startup="1" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx5.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx5_sect256KB.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C6245AZI-S3D02">
          <compile define="CY8C6245AZI_S3D02" />
        </device>
        <device Dname="CY8C6245AZI-S3D12">
          <compile define="CY8C6245AZI_S3D12" />
        </device>
        <device Dname="CY8C6245AZI-S3D42">
          <compile define="CY8C6245AZI_S3D42" />
        </device>
        <device Dname="CY8C6245AZI-S3D62">
          <compile define="CY8C6245AZI_S3D62" />
        </device>
        <device Dname="CY8C6245AZI-S3D72">
          <compile define="CY8C6245AZI_S3D72" />
        </device>
        <device Dname="CY8C6245FNI-S3D11">
          <compile define="CY8C6245FNI_S3D11" />
        </device>
        <device Dname="CY8C6245FNI-S3D41">
          <compile define="CY8C6245FNI_S3D41" />
        </device>
        <device Dname="CY8C6245FNI-S3D71">
          <compile define="CY8C6245FNI_S3D71" />
        </device>
        <device Dname="CY8C6245LQI-S3D02">
          <compile define="CY8C6245LQI_S3D02" />
        </device>
        <device Dname="CY8C6245LQI-S3D12">
          <compile define="CY8C6245LQI_S3D12" />
        </device>
        <device Dname="CY8C6245LQI-S3D42">
          <compile define="CY8C6245LQI_S3D42" />
        </device>
        <device Dname="CY8C6245LQI-S3D62">
          <compile define="CY8C6245LQI_S3D62" />
        </device>
        <device Dname="CY8C6245LQI-S3D72">
          <compile define="CY8C6245LQI_S3D72" />
        </device>
      </subFamily>
      <!-- PSoC 62, CY8C62x6 -->
      <subFamily DsubFamily="CY8C62x6">
        <debug Pname="Cortex-M0p" svd="SVD/psoc6_01.svd" />
        <debug Pname="Cortex-M4" svd="SVD/psoc6_01.svd" />
        <debugvars configfile="Debug/CY8C6xx7.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 1;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40010CD8;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40010800;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40010400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x07;               // 1M devices have 8 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000000FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000008;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V1
          __var hsiomPrt7PortSel0Addr = 0x40310070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40310090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403203A8;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403204A8;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403203B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403204B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <sequences>
          <sequence name="ResetProcessor" Pname="Cortex-M0p">
            <!-- ResetProcessor: Cortex-M0+ Processor reset via PSoC6 CPU Sub-System Controller. Cortex-M0+ doesn't have VECTRESET. -->
            <block>
              Write32(0x40210000, 0x05FA0000); // Reset CM0+ via "ENABLED" bit in CPUSS_CM0_CTL (M0+ Control Register)
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(0xE000EDF0) &amp; 0x02000000)" timeout="500000" />
          </sequence>
        </sequences>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00020000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00080000" default="1" startup="1" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx6.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx6_sect256KB.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx6.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx6_sect256KB.FLM" start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C6246BZI-D04">
          <compile define="CY8C6246BZI_D04" />
        </device>
      </subFamily>
      <!-- PSoC 62, CY8C62x7 -->
      <subFamily DsubFamily="CY8C62x7">
        <debug Pname="Cortex-M0p" svd="SVD/psoc6_01.svd" />
        <debug Pname="Cortex-M4" svd="SVD/psoc6_01.svd" />
        <debugvars configfile="Debug/CY8C6xx7.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 1;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40010CD8;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40010800;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40010400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x07;               // 1M devices have 8 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000000FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000008;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V1
          __var hsiomPrt7PortSel0Addr = 0x40310070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40310090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403203A8;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403204A8;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403203B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403204B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <sequences>
          <sequence name="ResetProcessor" Pname="Cortex-M0p">
            <!-- ResetProcessor: Cortex-M0+ Processor reset via PSoC6 CPU Sub-System Controller. Cortex-M0+ doesn't have VECTRESET. -->
            <block>
              Write32(0x40210000, 0x05FA0000); // Reset CM0+ via "ENABLED" bit in CPUSS_CM0_CTL (M0+ Control Register)
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(0xE000EDF0) &amp; 0x02000000)" timeout="500000" />
          </sequence>
        </sequences>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00048000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00100000" default="1" startup="1" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7_sect256KB.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx7.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx7_sect256KB.FLM" start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C6247BFI-D54">
          <compile define="CY8C6247BFI_D54" />
        </device>
