Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
            offset = pin;
            reg1 = (reg0 &amp; ~(PRT_SLOW_MASK &lt;&lt; offset)) | (pSlew &lt;&lt; offset); // Update value in SLOW[pin] field
            offset = 16 + pin * 2; // Offset of the DRIVE_SEL[pin] field for required pin number,
                                   // where '16' is the offset of DRIVE_SEL[pin] for pin 0 and '2' is the size of DRIVE_SEL[pin]
            reg1 = (reg1 &amp; ~(PRT_DRIVE_SEL_MASK &lt;&lt; offset)) | (pStrange &lt;&lt; offset); // Update value in DRIVE_SEL[pin] field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgOutAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <control if="confChanged |= 0">
              <block>
              Message(0, "Set TRACECLK to P7_0");
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P7_4 as TRACEDATA[3] -->
          <sequence name="SetupTracePin_P7_4" Pname="Cortex-M4">
            <block>
            __var pin = 4;                            // Pin number
            __var ioSelVal = 0x1B;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_data[0-3]' signals (P7, P9 and P10)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
            offset = pin;
            reg1 = (reg0 &amp; ~(PRT_SLOW_MASK &lt;&lt; offset)) | (pSlew &lt;&lt; offset); // Update value in SLOW[pin] field
            offset = 16 + pin * 2; // Offset of the DRIVE_SEL[pin] field for required pin number,
                                   // where '16' is the offset of DRIVE_SEL[pin] for pin 0 and '2' is the size of DRIVE_SEL[pin]
            reg1 = (reg1 &amp; ~(PRT_DRIVE_SEL_MASK &lt;&lt; offset)) | (pStrange &lt;&lt; offset); // Update value in DRIVE_SEL[pin] field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgOutAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <control if="confChanged |= 0">
              <block>
              Message(0, "Set TRACEDATA[3] to P7_4");
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P7_5 as TRACEDATA[2] -->
          <sequence name="SetupTracePin_P7_5" Pname="Cortex-M4">
            <block>
            __var pin = 5;                            // Pin number
            __var ioSelVal = 0x1B;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_data[0-3]' signals (P7, P9 and P10)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
            offset = pin;
            reg1 = (reg0 &amp; ~(PRT_SLOW_MASK &lt;&lt; offset)) | (pSlew &lt;&lt; offset); // Update value in SLOW[pin] field
            offset = 16 + pin * 2; // Offset of the DRIVE_SEL[pin] field for required pin number,
                                   // where '16' is the offset of DRIVE_SEL[pin] for pin 0 and '2' is the size of DRIVE_SEL[pin]
            reg1 = (reg1 &amp; ~(PRT_DRIVE_SEL_MASK &lt;&lt; offset)) | (pStrange &lt;&lt; offset); // Update value in DRIVE_SEL[pin] field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgOutAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <control if="confChanged |= 0">
              <block>
              Message(0, "Set TRACEDATA[2] to P7_5");
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P7_6 as TRACEDATA[1] -->
          <sequence name="SetupTracePin_P7_6" Pname="Cortex-M4">
            <block>
            __var pin = 6;                            // Pin number
            __var ioSelVal = 0x1B;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_data[0-3]' signals (P7, P9 and P10)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
            offset = pin;
            reg1 = (reg0 &amp; ~(PRT_SLOW_MASK &lt;&lt; offset)) | (pSlew &lt;&lt; offset); // Update value in SLOW[pin] field
            offset = 16 + pin * 2; // Offset of the DRIVE_SEL[pin] field for required pin number,
                                   // where '16' is the offset of DRIVE_SEL[pin] for pin 0 and '2' is the size of DRIVE_SEL[pin]
            reg1 = (reg1 &amp; ~(PRT_DRIVE_SEL_MASK &lt;&lt; offset)) | (pStrange &lt;&lt; offset); // Update value in DRIVE_SEL[pin] field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgOutAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <control if="confChanged |= 0">
              <block>
              Message(0, "Set TRACEDATA[1] to P7_6");
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P9_0 as TRACEDATA[3] -->
          <sequence name="SetupTracePin_P9_0" Pname="Cortex-M4">
            <block>
            __var pin = 0;                            // Pin number
            __var ioSelVal = 0x1B;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_data[0-3]' signals (P7, P9 and P10)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
