Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
      <!-- PSoC 63, CY8C63x7 Dual -->
      <subFamily DsubFamily="CY8C63x7 Dual">
        <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="100000000" />
        <processor Pname="Cortex-M4" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="150000000" />
        <description>PSoC 63 (Connectivity Line): Dual-core Cortex-M4/M0+ MCU series with programmable digital and analog peripherals, advanced graphics, CapSense, crypto and secure boot security, with integrated high-speed wired and wireless connectivity.</description>
        <debug Pname="Cortex-M0p" __ap="1" defaultResetSequence="ResetProcessor" svd="SVD/psoc6_01.svd" />
        <debug Pname="Cortex-M4" __ap="2" defaultResetSequence="ResetSystem" svd="SVD/psoc6_01.svd">
          <datapatch address="0xE008EFE0" value="0x000000A1" info="this is Cortex-M4 TPIU, not Cortex-M3 TPIU. Debuggers may determine by this that TPIU supports Half-Frame Syncs." />
        </debug>
        <debugvars configfile="Debug/CY8C6xx7.dbgconf" version="1.0">
          __var __TPIU_pinlocation = 1;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40010CD8;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40010800;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40010400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x07;               // 1M devices have 8 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000000FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000008;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V1
          __var hsiomPrt7PortSel0Addr = 0x40310070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40310090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403203A8;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403204A8;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403203B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403204B0;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <sequences>
          <sequence name="ResetProcessor" Pname="Cortex-M0p">
            <!-- ResetProcessor: Cortex-M0+ Processor reset via PSoC6 CPU Sub-System Controller. Cortex-M0+ doesn't have VECTRESET. -->
            <block>
              Write32(0x40210000, 0x05FA0000); // Reset CM0+ via "ENABLED" bit in CPUSS_CM0_CTL (M0+ Control Register)
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(0xE000EDF0) &amp; 0x02000000)" timeout="500000" />
          </sequence>
          <sequence name="DebugCoreStart" Pname="Cortex-M4">
            <block>
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            // Enable Core Debug via DHCSR
            Write32(DHCSR_Addr, 0xA05F0001);
          </block>
            <!-- Enable clock to ETM block for proper ETM detection if Parallel Trace Port enabled and it is Debug session -->
            <control if="((__connection &amp; 0x00000001) != 0) &amp;&amp; ((__traceout &amp; 0x00000002) != 0)">
              <block>
              Sequence("SetupTraceClock");
            </block>
            </control>
          </sequence>
          <!-- Configure pins trace pins if Parallel Trace Port enabled -->
          <sequence name="TraceStart" Pname="Cortex-M4">
            <control if="(__traceout &amp; 0x00000002) != 0" info="Parallel Trace Port enabled">
              <block>
              __var tpWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;
            </block>
              <control if="__TPIU_pinlocation == 1" info="CY8CKIT-062-WIFI-BT Like">
                <block>
                sequence("SetupTracePin_P7_0");
                sequence("SetupTracePin_P9_3");
              </block>
                <control if="tpWidth &gt;= 1">
                  <block>
                  sequence("SetupTracePin_P7_6");
                </block>
                </control>
                <control if="tpWidth &gt;= 2">
                  <block>
                  sequence("SetupTracePin_P7_5");
                  sequence("SetupTracePin_P7_4");
                </block>
                </control>
              </control>
              <control if="__TPIU_pinlocation == 2" info="CY8CKIT-062S2-43012 Like">
                <block>
                sequence("SetupTracePin_P7_0");
                sequence("SetupTracePin_P9_3");
              </block>
                <control if="tpWidth &gt;= 1">
                  <block>
                  sequence("SetupTracePin_P9_2");
                </block>
                </control>
                <control if="tpWidth &gt;= 2">
                  <block>
                  sequence("SetupTracePin_P9_1");
                  sequence("SetupTracePin_P9_0");
                </block>
                </control>
              </control>
            </control>
          </sequence>
          <sequence name="SetupTraceClock" Pname="Cortex-M4">
            <block>
            __var PERI_CLOCK_CTL_DIV_SEL_MASK = 0x0000000F;    // PERI_CLOCK_CTL.DIV_SEL
            __var PERI_DIV_CMD_ENABLE_MASK = 0x80000000;       // ENABLE field in PERI_DIV_CMD
            __var PERI_DIV_CMD_DISABLE_MASK = 0x40000000;      // DISABLE field in PERI_DIV_CMD
            // Peripheral clock divider index to use for trace clock
            __var ClockDivSel = PERI_CLOCK_CTL_DIV_SEL &amp; PERI_CLOCK_CTL_DIV_SEL_MASK;
            __var ClockDivVal = 0 &amp; PERI_DIV_PA_SEL_MASK;  // Peripheral clock divider value for trace clock
                                                               // Actual divider is (1+ClockDivVal)
            __var ClockCtlVal = Read32(TRACE_CLOCK_CTL_ADDR);
            __var ClockDivCtlVal = Read32(TRACE_CLOCK_DIV_CTL_ADDR + (ClockDivSel * 4));
          </block>
            <control if="(ClockCtlVal != ClockDivSel) || (ClockDivCtlVal != ((ClockDivVal &lt;&lt; PERI_DIV_CMD_PA_SEL_ROL) | 0x1))">
              <block>
              Message(0, "Setup TPIU clock");
              // DISABLE 8.0 DIV in PERI_DIV_CMD:
              __var ClockDivCmd = PERI_DIV_CMD_DISABLE_MASK | (PERI_DIV_PA_SEL_MASK &lt;&lt; PERI_DIV_CMD_PA_SEL_ROL) | ClockDivSel;
              Write32(TRACE_CLOCK_DIV_CMD_ADDR, ClockDivCmd);
              // Use selected divider (8.0) for cpuss.clock_trace_in
              Write32(TRACE_CLOCK_CTL_ADDR, ClockDivSel);
              // Set 8.0 DIV = ClockDivVal
              Write32((TRACE_CLOCK_DIV_CTL_ADDR + (ClockDivSel * 4)), (ClockDivVal &lt;&lt; 8));
              // ENABLE 8.0 DIV
              ClockDivCmd = PERI_DIV_CMD_ENABLE_MASK | (PERI_DIV_PA_SEL_MASK &lt;&lt; PERI_DIV_CMD_PA_SEL_ROL) | ClockDivSel;
              Write32(TRACE_CLOCK_DIV_CMD_ADDR, ClockDivCmd);
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P7_0 as TRACECLK -->
          <sequence name="SetupTracePin_P7_0" Pname="Cortex-M4">
            <block>
            __var pin = 0;                            // Pin number
            __var ioSelVal = 0x1A;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_clock' signal (P7_0)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
            offset = pin;
            reg1 = (reg0 &amp; ~(PRT_SLOW_MASK &lt;&lt; offset)) | (pSlew &lt;&lt; offset); // Update value in SLOW[pin] field
            offset = 16 + pin * 2; // Offset of the DRIVE_SEL[pin] field for required pin number,
                                   // where '16' is the offset of DRIVE_SEL[pin] for pin 0 and '2' is the size of DRIVE_SEL[pin]
            reg1 = (reg1 &amp; ~(PRT_DRIVE_SEL_MASK &lt;&lt; offset)) | (pStrange &lt;&lt; offset); // Update value in DRIVE_SEL[pin] field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgOutAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <control if="confChanged |= 0">
              <block>
              Message(0, "Set TRACECLK to P7_0");
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P7_4 as TRACEDATA[3] -->
          <sequence name="SetupTracePin_P7_4" Pname="Cortex-M4">
            <block>
            __var pin = 4;                            // Pin number
            __var ioSelVal = 0x1B;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_data[0-3]' signals (P7, P9 and P10)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
            offset = pin;
            reg1 = (reg0 &amp; ~(PRT_SLOW_MASK &lt;&lt; offset)) | (pSlew &lt;&lt; offset); // Update value in SLOW[pin] field
            offset = 16 + pin * 2; // Offset of the DRIVE_SEL[pin] field for required pin number,
                                   // where '16' is the offset of DRIVE_SEL[pin] for pin 0 and '2' is the size of DRIVE_SEL[pin]
            reg1 = (reg1 &amp; ~(PRT_DRIVE_SEL_MASK &lt;&lt; offset)) | (pStrange &lt;&lt; offset); // Update value in DRIVE_SEL[pin] field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgOutAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <control if="confChanged |= 0">
              <block>
              Message(0, "Set TRACEDATA[3] to P7_4");
            </block>
            </control>
          </sequence>
          <!-- Setup Trace Pin P7_5 as TRACEDATA[2] -->
          <sequence name="SetupTracePin_P7_5" Pname="Cortex-M4">
            <block>
            __var pin = 5;                            // Pin number
            __var ioSelVal = 0x1B;                    // IO[pin]_SEL field value (connection) for HSIOM_PRT[port]_PORT_SEL register. Connection route for 'cpuss.trace_data[0-3]' signals (P7, P9 and P10)
            __var reg0;
            __var reg1;
            __var offset;
            __var hsiomRegAddr; // Address of HSIOM_PRT[port]_PORT_SEL0 or HSIOM_PRT[port]_PORT_SEL1
            __var pMode = 6;  // pin drive mode
                              //  0: HIGHZ:         Output buffer is off creating a high impedance input (default)
                              //  1: RESERVED:      This mode is reserved and should not be used
                              //  2: PULLUP:        Resistive pull up
                              //  3: PULLDOWN:      Resistive pull down
                              //  4: OD_DRIVESLOW:  Open drain, drives low
                              //  5: OD_DRIVESHIGH: Open drain, drives high
                              //  6: STRONG:        Strong D_OUTput buffer
                              //  7: PULLUP_DOWN:   Pull up or pull down
            __var pSlew = 0;  // pin slew rate
                              //  0 - Fast slew rate (default)
                              //  1 - Slow slew rate
            __var pStrange = 2;   // pin drive strange
                                  //  0 - FULL_DRIVE:        Full drive strength: GPIO drives current at its max rated spec.
                                  //  1 - ONE_HALF_DRIVE:    1/2 drive strength: GPIO drives current at 1/2 of its max rated spec (default)
                                  //  2 - ONE_QUARTER_DRIVE: 1/4 drive strength: GPIO drives current at 1/4 of its max rated spec.
                                  //  3 - ONE_EIGHTH_DRIVE:  1/8 drive strength: GPIO drives current at 1/8 of its max rated spec.
            __var confChanged = 0; // Pin's configuration change flag
            __var PRT_IO_SEL_MASK = 0x1F;    // Mask for IO[pin]_SEL field in HSIOM_PRT[port]_PORT_SEL[0/1] register
            __var PRT_DRIVE_MODE_MASK = 0xF; // Mask for IN_EN[pin] and DRIVE_MODE[pin] fields in GPIO_PRT[port]_CFG register
            __var PRT_SLOW_MASK = 0x1;       // Mask for SLOW[pin] field in GPIO_PRT[port]_CFG_OUT register
            __var PRT_DRIVE_SEL_MASK = 0x3;  // Mask for DRIVE_SEL[pin] field in GPIO_PRT[port]_CFG_OUT register
          </block>
            <!-- Select pin route connection in HSIOM_PRT[port]_PORT_SEL[0/1] register -->
            <control if="pin &lt; 4">
              <block>
              // Pin[0-3] selection is in HSIOM_PRT[port]_PORT_SEL0 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr; // Use HSIOM_PRT[port]_PORT_SEL0
              offset = pin * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <control if="pin &gt; 3">
              <block>
              // Pin[4-7] selection is in HSIOM_PRT[port]_PORT_SEL1 register
              hsiomRegAddr = hsiomPrt7PortSel0Addr + 4; // Use HSIOM_PRT[port]_PORT_SEL1
              offset = (pin &amp; 3) * 8; // Offset of the IO[pin]_SEL field for required pin number,
                                      // where 8 = 5 bits for IO[pin]_SEL field + 3 not used bits
            </block>
            </control>
            <block>
            reg0 = Read32(hsiomRegAddr);
            reg1 = (reg0 &amp; ~(PRT_IO_SEL_MASK &lt;&lt; offset)) | (ioSelVal &lt;&lt; offset); // Update value in IO[pin]_SEL field
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(hsiomRegAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Disable input buffer and set drive mode in GPIO_PRT[port]_CFG register -->
            <block>
            reg0 = Read32(gpioPrt7CfgAddr);
            offset = pin * 4;   // Offset of the DRIVE_MODE[pin] field for required pin number,
                                // where 4 = 3 bits for DRIVE_MODE[pin] + 1 bit for IN_EN fields
            reg1 = (reg0 &amp; ~(PRT_DRIVE_MODE_MASK &lt;&lt; offset)) | (pMode &lt;&lt; offset); // Update value in IN_EN[pin] and DRIVE_MODE[pin] fields
          </block>
            <control if="reg0 |= reg1">
              <block>
              Write32(gpioPrt7CfgAddr, reg1);
              confChanged = 1;
            </block>
            </control>
            <!-- Set slew rate and drive strength in GPIO_PRT[port]_CFG_OUT register -->
            <block>
            reg0 = Read32(gpioPrt7CfgOutAddr);
