Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
        <device Dname="CY8C6347BZI-BLD34">
          <compile define="CY8C6347BZI_BLD34" />
        </device>
        <device Dname="CY8C6347BZI-BLD43">
          <compile define="CY8C6347BZI_BLD43" />
        </device>
        <device Dname="CY8C6347BZI-BLD44">
          <compile define="CY8C6347BZI_BLD44" />
        </device>
        <device Dname="CY8C6347BZI-BLD53">
          <compile define="CY8C6347BZI_BLD53" />
        </device>
        <device Dname="CY8C6347BZI-BLD54">
          <compile define="CY8C6347BZI_BLD54" />
        </device>
        <device Dname="CY8C6347FMI-BLD13">
          <compile define="CY8C6347FMI_BLD13" />
        </device>
        <device Dname="CY8C6347FMI-BLD33">
          <compile define="CY8C6347FMI_BLD33" />
        </device>
        <device Dname="CY8C6347FMI-BLD43">
          <compile define="CY8C6347FMI_BLD43" />
        </device>
        <device Dname="CY8C6347FMI-BLD53">
          <compile define="CY8C6347FMI_BLD53" />
        </device>
        <device Dname="CY8C6347FMI-BUD13">
          <compile define="CY8C6347FMI_BUD13" />
        </device>
        <device Dname="CY8C6347FMI-BUD33">
          <compile define="CY8C6347FMI_BUD33" />
        </device>
        <device Dname="CY8C6347FMI-BUD43">
          <compile define="CY8C6347FMI_BUD43" />
        </device>
        <device Dname="CY8C6347FMI-BUD53">
          <compile define="CY8C6347FMI_BUD53" />
        </device>
        <device Dname="CY8C6347LQI-BLD52">
          <compile define="CY8C6347LQI_BLD52" />
        </device>
        <device Dname="CYBLE-416045-02">
          <compile define="CYBLE_416045_02" />
        </device>
      </subFamily>
    </family>
    <!-- PSoC 64 -->
    <family Dfamily="PSoC 64" Dvendor="Infineon:7">
      <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="100000000" />
      <processor Pname="Cortex-M4" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="150000000" />
      <description>PSoC 64 (Security Line): Dual-core Cortex-M4/M0+ MCU series with programmable digital and analog peripherals, advanced graphics, CapSense, crypto and secure boot security.</description>
      <debug Pname="Cortex-M0p" __ap="1" defaultResetSequence="ResetProcessor" />
      <debug Pname="Cortex-M4" __ap="2" defaultResetSequence="ResetSystem">
        <datapatch address="0xE008EFE0" value="0x000000A1" info="this is Cortex-M4 TPIU, not Cortex-M3 TPIU. Debuggers may determine by this that TPIU supports Half-Frame Syncs." />
      </debug>
      <book name="README.txt" title="Infineon PSoC 6 DFP user guide" />
      <book name="known_issues.txt" title="Infineon PSoC 6 DFP known issues" />
      <sequences>
        <sequence name="DAP_Handshake">
          <!-- DAP_Handshake: Execute initial handshake sequence depend on selected protocol -->
          <block>
            __var isSWJ      = ((__protocol &amp; 0x00010000) != 0);
            __var protType   = __protocol &amp; 0x0000FFFF;
            __var DPIDR = 0;
            __Result = 0;
          </block>
          <!-- JTAG Protocol -->
          <control if="protType == 1">
            <control if="isSWJ">
              <block atomic="true">
                // Ensure current debug interface is in reset state
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                // Execute SWJ-DP Switch Sequence SWD to JTAG (0xE73C)
                // Change if SWJ-DP uses deprecated switch code (0xAEAE)
                DAP_SWJ_Sequence(16, 0xE73C);
              </block>
            </control>
            <block atomic="true">
              // JTAG "Soft" Reset
              DAP_JTAG_Sequence(6, 1, 0x00);                        // Test-Logic-Reset
              // Get IDCODE to make shure that JTAG-DP is available
              DAP_JTAG_Sequence(4, 0, 0x00);                        // 4*Run-Test/Idle
              DAP_JTAG_Sequence(2, 1, 0x00);                        // ~ Select-DR ~ Select-IR
              DAP_JTAG_Sequence(2, 0, 0x00);                        // ~ Capture-IR ~ Shift-IR
              DAP_JTAG_Sequence(8, 0, 0xFE);                        // Shift-IR (IDCODE BYPASS)
              DAP_JTAG_Sequence(5, 1, 0x00);                        // ~ Exit1-IR (IDCODE BYPASS) ~ Update-IR ~ Test-Logic-Reset
              DAP_JTAG_Sequence(4, 0, 0x00);                        // Make sure that we go through Idle state in TAP controller
              DAP_JTAG_Sequence(1, 1, 0x00);                        // Select-DR
              DAP_JTAG_Sequence(2, 0, 0x00);                        // ~ Capture-DR ~ Shift-DR
              DPIDR = DAP_JTAG_Sequence(33, 0, 0x00000000);         // Shift 33-bits data
              DAP_JTAG_Sequence(5, 1, 0x00);                        // ~ Exit1-DR ~ Update-DR ~ ~ Select-DR ~ Select-IR ~ Test-Logic-Reset
              DAP_JTAG_Sequence(4, 0, 0x00);                        // Make sure that we go through Idle state in TAP controller
            </block>
          </control>
          <!-- SWD Protocol -->
          <control if="protType == 2">
            <control if="isSWJ">
              <block atomic="true">
                // Ensure current debug interface is in reset state
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                // Execute SWJ-DP Switch Sequence JTAG to SWD (0xE79E)
                // Change if SWJ-DP uses deprecated switch code (0xEDB6)
                DAP_SWJ_Sequence(16, 0xE79E);
                // Enter SWD Line Reset State
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF); // More than 50 cycles SWDIO/TMS High
                DAP_SWJ_Sequence(3,  0x00);               // At least 2 idle cycles (SWDIO/TMS Low)
              </block>
            </control>
            <control if="!isSWJ">
              <block atomic="true">
                // Enter SWD Line Reset State
                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF); // More than 50 cycles SWDIO/TMS High
                DAP_SWJ_Sequence(3,  0x00);               // At least 2 idle cycles (SWDIO/TMS Low)
              </block>
            </control>
            <block>
              DPIDR = ReadDP(0x0); // Read DPIDR to enable SWD interface (SW-DPv1 and SW-DPv2)
            </block>
          </control>
          <control if="(DPIDR &amp; 0xFFF00FFF) != 0x6BA00477">
            <block>
              __Result = -1; // DAP is unavailable
            </block>
          </control>
        </sequence>
        <sequence name="DAP_poll">
          <!-- DAP_poll: Poll the DAP until it becomes available -->
          <block>
            __Result = -1; // Assume DAP is not available yet
          </block>
          <control while="__Result != 0" timeout="600000">
            <block>
              sequence("DAP_Handshake"); // Poll DP until bootloader allows access to device (can be up to 600ms)
            </block>
          </control>
          <control if="__Result != 0">
            <block>
              Message(1, "The Debug Access Port is unavailable.");
            </block>
          </control>
        </sequence>
        <sequence name="DebugPortSetup">
          <!-- DebugPortSetup: Prepare the target debug port for connection -->
          <block>
            sequence("DAP_Handshake");
          </block>
          <control if="__Result != 0">
            <!-- In case DAP isn't avalable, execute a system-wide reset via dedicated debugger reset line. -->
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;
              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF); // Deassert nRESET line
            </block>
            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000" />
            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000" />
            </control>
            <control if="!canReadPins">
              <block>
                DAP_SWJ_Pins(nReset, nReset, 0); // Assert nRESET line
              </block>
              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000" />
            </control>
            <block>
              sequence("DAP_poll");
            </block>
          </control>
        </sequence>
        <sequence name="DebugPortStart">
          <!-- DebugPortStart: Connect to the target debug port and power it up -->
          <block info="Read DP CTRL/STAT">
            __var SW_DP_ABORT  = 0x0;
            __var DP_CTRL_STAT = 0x4;
            __var DP_SELECT    = 0x8;
            __var powered_down = 0;
            // Switch to DP Register Bank 0. Explicitly set APSEL to current AP selection
            WriteDP(DP_SELECT, __ap &lt;&lt; 24);
            // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
            powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
          </block>
          <control if="powered_down">
            <block info="Power Up System &amp; Debug">
              // Request Debug/System Power-Up
              // Ignore error here: even there is a polling in the next block, CMSIS-DAP transports reads DP.RDBUFF register
              // right after write to DP.CTRL_STAT. This will fail for some cases - for example if device is waking from DeepSleep.
              __errorcontrol = 1;
              WriteDP(DP_CTRL_STAT, 0x50000000);
              __errorcontrol = 0;
            </block>
            <!-- Wait for Power-Up Request to be acknowledged -->
            <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000" info="Wait for power acknowledged" />
            <!-- CDBGRSTREQ on PSoC6 behaves like Power-On Reset. Not desired when starting the Debug Port
            <block info="Debug Reset">
              __errorcontrol = 1;
              // Request Debug Reset
              WriteDP(DP_CTRL_STAT, 0x54000000);
              // CDBGRSTREQ is equivalent to Power-On Reset and fully reboots the device.
              // Depending on the user application the reboot can take up to 600ms.
              DAP_Delay(600000);
              __errorcontrol = 0;
            </block>
            -->
            <!-- Wait for Debug Reset to be acknowledged, don't issue error on timeout to deal with improperly connected Debug Reset -->
            <!-- <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA8000000) != 0xA8000000" timeout="300000" info="Wait for Debug Reset Acknowledge"/> -->
            <!-- JTAG Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 1">
              <block info="JTAG: Clear Sticky Bits">
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                WriteDP(DP_CTRL_STAT, 0x50000F32);
              </block>
            </control>
            <!-- SWD Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 2">
              <block info="SWD: Init SWD &amp; Clear Sticky Bits">
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                WriteDP(DP_CTRL_STAT, 0x50000F00);
                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                WriteDP(SW_DP_ABORT, 0x0000001E);
              </block>
            </control>
          </control>
          <block>
            Sequence("PrintDeviceInfo"); // Print device info
          </block>
        </sequence>
        <sequence name="ResetHardware">
          <!-- ResetHardware: HW Reset causes a reboot of the device which also resets debug.
               - Using this as a prereset is OK to potentially wake up the system from DeepSleep.
               - Using this in the middle of the debug session will break the connection unless recovery
                 from a connection loss is supported by the debug IDE.
          -->
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF); // Deassert nRESET line
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000" />
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000" />
          </control>
          <control if="!canReadPins">
            <block>
              DAP_SWJ_Pins(nReset, nReset, 0); // Assert nRESET line
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000" />
          </control>
          <block>
            // Give the PSoC6 bootloader time to finish (can be up to 600ms)
            DAP_Delay(600000);
          </block>
        </sequence>
        <sequence name="PrintDeviceInfo">
          <!-- PrintDeviceInfo: Read and print device info -->
          <block>
            __var siId;
            __var siRev;
            __var siFamily;
            __var fbVerHi;
            __var sflashSvnVer;
            __var protection;
            __var v;
            Message(0, "****************************************************");
            // Get Si Id, Family and Rev.
            v = Read32(0x16000000);
            siId = (v &amp; 0xFFFF0000) &gt;&gt; 16;
            siRev = (v &amp; 0x0000FF00) &gt;&gt; 8;
            v = Read32(0x1600000C);
            siFamily = v &amp; 0x00000FFF;
            Message(0, "** Silicon: 0x%04X, Family: 0x%03X, Rev.: 0x%02X", siId, siFamily, siRev);
            // Get FlashBboot verison
            fbVerHi = Read32(0x16002004);
          </block>
          <control if="fbVerHi == 0">
            <block>
              Message(1, "Invalid FlashBoot: High version word of Flash Boot is zero");
            </block>
          </control>
          <control if="fbVerHi != 0">
            <block>
              __var fbVerLo = Read32(0x16002018);
              __var b0 = fbVerHi &gt;&gt; 28;
              __var b1 = (fbVerHi &gt;&gt; 24) &amp; 0x0F;
              __var b2 = (fbVerHi &gt;&gt; 16) &amp; 0xFF;
              __var b3 = fbVerHi &amp; 0x0000FFFF;
            </block>
            <control if="b0 &gt; 2">
              <block>
                Message(1, "Unsupported Flash Boot Version - Flash Boot Version [31:28] = 0x%X", b0);
              </block>
            </control>
            <control if="b0 &lt;= 2">
              <control if="b3 != 0x8001">
                <block>
                  Message(1, "Flash Boot is corrupted or non Flash Boot image programmed");
                </block>
              </control>
              <control if="b3 == 0x8001">
                <control if="b0 == 0">
                  <control if="b1 == 1">
                    <block>
                      Message(0, "** Flash Boot version: 1.%02u", b2);
                    </block>
                  </control>
                  <control if="b1 == 2">
                    <control if="b2 &lt; 20">
                      <block>
                        Message(0, "** Flash Boot version: 1.0.0.%u", b2);
                      </block>
                    </control>
                    <control if="(b2 &gt;= 20) &amp;&amp; (b2 &lt; 29)">
                      <block>
                        Message(0, "** Flash Boot version: 1.0.1.%u", b2);
                      </block>
                    </control>
                    <control if="b2 &gt;= 29">
                      <block>
                        Message(0, "** Flash Boot version: 1.20.1.%u", b2);
                      </block>
                    </control>
                  </control>
                </control>
                <control if="b0 == 1">
                  <block>
                    Message(0, "** Flash Boot version: 2.0.0.%u", b2);
                  </block>
                </control>
                <control if="b0 == 2">
                  <block>
                    __var patch = fbVerLo &gt;&gt; 24;
                    __var build = fbVerLo &amp; 0x0000FFFF;
                    Message(0, "** Flash Boot version: %u.%u.%u.%u", b1, b2, patch, build);
                  </block>
                </control>
              </control>
            </control>
          </control>
          <block>
            sflashSvnVer = Read32(0x16000028); // Get SFLASH version
          </block>
          <control if="(sflashSvnVer != 0) &amp;&amp; (sflashSvnVer != 0xFFFFFFFF)">
            <block>
              Message(0, "** SFlash version: %u", sflashSvnVer);
            </block>
          </control>
          <!-- Get life-cycle stage -->
          <control if="siFamily == 0x100">
            <block>
              protection = Read32(0x40210500); // PSoC 6-BLE2 family
            </block>
          </control>
          <control if="siFamily != 0x100">
            <block>
              protection = Read32(0x402020C4); // PSoC 6-2M family
            </block>
          </control>
          <!-- Decode life-cycle stage -->
          <control if="protection == 1">
            <block>
              Message(0, "** Chip Protection: VIRGIN");
            </block>
          </control>
          <control if="protection == 2">
            <block>
              Message(0, "** Chip Protection: NORMAL");
            </block>
          </control>
          <control if="protection == 3">
            <block>
              Message(0, "** Chip Protection: SECURE");
            </block>
          </control>
          <control if="protection == 4">
            <block>
              Message(0, "** Chip Protection: DEAD");
            </block>
          </control>
          <control if="(protection == 0) || (protection &gt; 4)">
            <block>
              Message(0, "** Chip Protection: UNKNOWN");
            </block>
          </control>
          <block>
            Message(0, "****************************************************");
          </block>
        </sequence>
      </sequences>
      <!-- PSoC 64, CYB06xx5 -->
      <subFamily DsubFamily="CYB06xx5">
        <debug Pname="Cortex-M0p" svd="SVD/psoc6_03.svd" />
        <debug Pname="Cortex-M4" svd="SVD/psoc6_03.svd" />
        <sequences>
          <sequence name="ResetProcessor" Pname="Cortex-M0p">
            <!-- ResetProcessor: Cortex-M0+ Processor reset via PSoC6 CPU Sub-System Controller. Cortex-M0+ doesn't have VECTRESET. -->
            <block>
              Write32(0x40201000, 0x05FA0000); // Reset CM0+ via "ENABLED" bit in CPUSS_CM0_CTL (M0+ Control Register)
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(0xE000EDF0) &amp; 0x02000000)" timeout="500000" />
          </sequence>
        </sequences>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00040000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00060000" default="1" startup="1" />
        <algorithm Pname="Cortex-M0p" name="Flash/CYxx64x5.FLM" start="0x10000000" size="0x00060000" RAMstart="0x08020000" RAMsize="0xC000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF_S25Hx512T.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08020000" RAMsize="0xC000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CYxx64x5.FLM" start="0x10000000" size="0x00060000" RAMstart="0x08001800" RAMsize="0x1E800" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SMIF_S25Hx512T.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08001800" RAMsize="0x1E800" default="0" style="Keil" />
        <device Dname="CYB06445LQI-S3D42">
          <compile define="CYB06445LQI_S3D42" />
        </device>
      </subFamily>
      <!-- PSoC 64, CYB06xx7 -->
      <subFamily DsubFamily="CYB06xx7">
        <debug Pname="Cortex-M0p" svd="SVD/psoc6_01.svd" />
        <debug Pname="Cortex-M4" svd="SVD/psoc6_01.svd" />
        <sequences>
          <sequence name="ResetProcessor" Pname="Cortex-M0p">
            <!-- ResetProcessor: Cortex-M0+ Processor reset via PSoC6 CPU Sub-System Controller. Cortex-M0+ doesn't have VECTRESET. -->
            <block>
              Write32(0x40210000, 0x05FA0000); // Reset CM0+ via "ENABLED" bit in CPUSS_CM0_CTL (M0+ Control Register)
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(0xE000EDF0) &amp; 0x02000000)" timeout="500000" />
          </sequence>
        </sequences>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00048000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x000D0000" default="1" startup="1" />
        <algorithm Pname="Cortex-M0p" name="Flash/CYxx64xx.FLM" start="0x10000000" size="0x000D0000" RAMstart="0x08020000" RAMsize="0xC000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08020000" RAMsize="0xC000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF_S25Hx512T.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08020000" RAMsize="0xC000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CYxx64xx.FLM" start="0x10000000" size="0x000D0000" RAMstart="0x08001800" RAMsize="0x1E800" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_WFLASH.FLM" start="0x14000000" size="0x00008000" RAMstart="0x08001800" RAMsize="0x1E800" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxx_SMIF_S25Hx512T.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08001800" RAMsize="0x1E800" default="0" style="Keil" />
        <device Dname="CYB06447BZI-BLD53">
          <compile define="CYB06447BZI_BLD53" />
        </device>
        <device Dname="CYB06447BZI-BLD54">
          <compile define="CYB06447BZI_BLD54" />
        </device>
