Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
          __var __TPIU_pinlocation = 2;  // Select one of the possible TPIU pin locations
          // TraceClock configuration data
          __var TRACE_CLOCK_CTL_ADDR = 0x40000C54;           // Clock control register for cpuss.clock_trace_in
          __var TRACE_CLOCK_DIV_CTL_ADDR = 0x40001000;       // Divider control (for 8.0 divider)
          __var TRACE_CLOCK_DIV_CMD_ADDR = 0x40000400;       // Divider command
          __var PERI_CLOCK_CTL_DIV_SEL = 0x03;               // 512K devices have 4 of 8-bit dividers - use the lastest available for tracing
          __var PERI_DIV_PA_SEL_MASK = 0x000003FF;           // PA_TYPE_SEL + PA_DIV_SEL fields mask (size)
          __var PERI_DIV_CMD_PA_SEL_ROL = 0x00000010;        // PA_TYPE_SEL + PA_DIV_SEL fields offset in PERI_DIV_CMD
          // TPIU pins configuration data, IOSS V2
          __var hsiomPrt7PortSel0Addr = 0x40300070;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 7 selection 0
          __var hsiomPrt9PortSel0Addr = 0x40300090;  // HSIOM_PRT[port]_PORT_SEL0·register·address. Port 9 selection 0
          __var gpioPrt7CfgAddr = 0x403103C4;        // GPIO_PRT[port]_CFG register address. Port 7 configuration
          __var gpioPrt9CfgAddr = 0x403104C4;        // GPIO_PRT[port]_CFG register address. Port 9 configuration
          __var gpioPrt7CfgOutAddr = 0x403103CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 7 output buffer configuration
          __var gpioPrt9CfgOutAddr = 0x403104CC;     // GPIO_PRT[port]_CFG_OUT register address. Port 9 output buffer configuration
        </debugvars>
        <memory name="IRAM1" access="rwx" start="0x08000000" size="0x00020000" default="1" />
        <memory name="IROM1" access="rx" start="0x10000000" size="0x00040000" default="1" startup="1" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx4.FLM" start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx4_sect128KB.FLM" start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx4.FLM" start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xx4_sect128KB.FLM" start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_NAR.FLM" start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="1" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_SMIF.FLM" start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <algorithm Pname="Cortex-M4" name="Flash/CY8C6xxA_EFUSE.FLM" start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default="0" style="Keil" />
        <device Dname="CY8C4588AZI-H675">
          <compile define="CY8C4588AZI_H675" />
        </device>
        <device Dname="CY8C4588AZI-H676">
          <compile define="CY8C4588AZI_H676" />
        </device>
        <device Dname="CY8C4588AZI-H685">
          <compile define="CY8C4588AZI_H685" />
        </device>
        <device Dname="CY8C4588AZI-H686">
          <compile define="CY8C4588AZI_H686" />
        </device>
        <device Dname="CY8C4588AZQ-H685">
          <compile define="CY8C4588AZQ_H685" />
        </device>
        <device Dname="CY8C4588AZQ-H686">
          <compile define="CY8C4588AZQ_H686" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <condition id="PSoC 6">
      <description>PSoC 6 devices</description>
      <accept condition="PSoC 60" />
      <accept condition="PSoC 61" />
      <accept condition="PSoC 62" />
      <accept condition="PSoC 63" />
      <accept condition="PSoC 64" />
      <accept condition="PSoC 4500H" />
      <require Cclass="Device" Cgroup="Startup" />
    </condition>
    <condition id="PSoC 60">
      <description>PSoC 60 devices</description>
      <accept Dvendor="Infineon:7" Dname="CY8C6016BZI-F04" />
      <accept Dvendor="Infineon:7" Dname="CY8C6036BZI-F04" />
    </condition>
    <condition id="PSoC 61">
      <description>PSoC 61 devices</description>
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZI-S4F12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZI-S4F62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZI-S4F82" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZI-S4F83" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZI-S4F92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZI-S4F93" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZQ-S4F92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144AZQ-S4F93" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144LQI-S4F12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144LQI-S4F62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144LQI-S4F82" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144LQI-S4F92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6144LQQ-S4F92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145AZI-S3F02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145AZI-S3F12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145AZI-S3F42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145AZI-S3F62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145AZI-S3F72" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145FNI-S3F11" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145FNI-S3F41" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145FNI-S3F71" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145LQI-S3F02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145LQI-S3F12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145LQI-S3F42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145LQI-S3F62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6145LQI-S3F72" />
      <accept Dvendor="Infineon:7" Dname="CY8C6116BZI-F54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6136BZI-F14" />
      <accept Dvendor="Infineon:7" Dname="CY8C6136BZI-F34" />
      <accept Dvendor="Infineon:7" Dname="CY8C6136FDI-F42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6136FTI-F42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6117BZI-F34" />
      <accept Dvendor="Infineon:7" Dname="CY8C6117FDI-F02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6117WI-F34" />
      <accept Dvendor="Infineon:7" Dname="CY8C6137BZI-F14" />
      <accept Dvendor="Infineon:7" Dname="CY8C6137BZI-F34" />
      <accept Dvendor="Infineon:7" Dname="CY8C6137BZI-F54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6137FDI-F02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6137WI-F54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6148AZI-S2F44" />
      <accept Dvendor="Infineon:7" Dname="CY8C6148BZI-S2F44" />
      <accept Dvendor="Infineon:7" Dname="CY8C6148FNI-S2F43" />
      <accept Dvendor="Infineon:7" Dname="CY8C6148LQI-S2F02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6148LQI-S2F42" />
      <accept Dvendor="Infineon:7" Dname="CY8C614AAZI-S2F04" />
      <accept Dvendor="Infineon:7" Dname="CY8C614AAZI-S2F14" />
      <accept Dvendor="Infineon:7" Dname="CY8C614AAZI-S2F44" />
      <accept Dvendor="Infineon:7" Dname="CY8C614ABZI-S2F04" />
      <accept Dvendor="Infineon:7" Dname="CY8C614ABZI-S2F44" />
      <accept Dvendor="Infineon:7" Dname="CY8C614AFNI-S2F03" />
      <accept Dvendor="Infineon:7" Dname="CY8C614AFNI-S2F43" />
      <accept Dvendor="Infineon:7" Dname="CY8C614ALQI-S2F02" />
      <accept Dvendor="Infineon:7" Dname="CY8C614ALQI-S2F42" />
    </condition>
    <condition id="PSoC 62">
      <description>PSoC 62 devices</description>
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZI-S4D12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZI-S4D62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZI-S4D82" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZI-S4D83" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZI-S4D92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZI-S4D93" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZQ-S4D92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244AZQ-S4D93" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244LQI-S4D12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244LQI-S4D62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244LQI-S4D82" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244LQI-S4D92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6244LQQ-S4D92" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245AZI-S3D02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245AZI-S3D12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245AZI-S3D42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245AZI-S3D62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245AZI-S3D72" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245FNI-S3D11" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245FNI-S3D41" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245FNI-S3D71" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245LQI-S3D02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245LQI-S3D12" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245LQI-S3D42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245LQI-S3D62" />
      <accept Dvendor="Infineon:7" Dname="CY8C6245LQI-S3D72" />
      <accept Dvendor="Infineon:7" Dname="CY8C6246BZI-D04" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247BFI-D54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247BZI-AUD54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247BZI-D34" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247BZI-D44" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247BZI-D54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247FDI-D02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247FDI-D32" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247FDI-D52" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247FTI-D52" />
      <accept Dvendor="Infineon:7" Dname="CY8C6247WI-D54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6248AZI-S2D14" />
      <accept Dvendor="Infineon:7" Dname="CY8C6248AZI-S2D44" />
      <accept Dvendor="Infineon:7" Dname="CY8C6248BZI-S2D44" />
      <accept Dvendor="Infineon:7" Dname="CY8C6248FNI-S2D43" />
      <accept Dvendor="Infineon:7" Dname="CY8C6248LQI-S2D02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6248LQI-S2D42" />
      <accept Dvendor="Infineon:7" Dname="CY8C624AAZI-S2D14" />
      <accept Dvendor="Infineon:7" Dname="CY8C624AAZI-S2D44" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ABZI-D44" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ABZI-S2D04" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ABZI-S2D14" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ABZI-S2D44" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ABZI-S2D44A0" />
      <accept Dvendor="Infineon:7" Dname="CY8C624AFNI-S2D43" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ALQI-S2D02" />
      <accept Dvendor="Infineon:7" Dname="CY8C624ALQI-S2D42" />
    </condition>
