Infineon/cmsis-packs/PSoC6_DFP/Infineon.PSoC6_DFP.pdsc
    <condition id="PSoC 63">
      <description>PSoC 63 devices</description>
      <accept Dvendor="Infineon:7" Dname="CY8C6316BZI-BLF03" />
      <accept Dvendor="Infineon:7" Dname="CY8C6316BZI-BLF04" />
      <accept Dvendor="Infineon:7" Dname="CY8C6316BZI-BLF53" />
      <accept Dvendor="Infineon:7" Dname="CY8C6316BZI-BLF54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6336BZI-BLD13" />
      <accept Dvendor="Infineon:7" Dname="CY8C6336BZI-BLD14" />
      <accept Dvendor="Infineon:7" Dname="CY8C6336BZI-BLF03" />
      <accept Dvendor="Infineon:7" Dname="CY8C6336BZI-BLF04" />
      <accept Dvendor="Infineon:7" Dname="CY8C6336LQI-BLF02" />
      <accept Dvendor="Infineon:7" Dname="CY8C6336LQI-BLF42" />
      <accept Dvendor="Infineon:7" Dname="CY8C6337BZI-BLF13" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347BZI-BLD33" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347BZI-BLD34" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347BZI-BLD43" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347BZI-BLD44" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347BZI-BLD53" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347BZI-BLD54" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BLD13" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BLD33" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BLD43" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BLD53" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BUD13" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BUD33" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BUD43" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347FMI-BUD53" />
      <accept Dvendor="Infineon:7" Dname="CY8C6347LQI-BLD52" />
      <accept Dvendor="Infineon:7" Dname="CYBLE-416045-02" />
    </condition>
    <condition id="PSoC 64">
      <description>PSoC 64 devices</description>
      <accept Dvendor="Infineon:7" Dname="CYB06445LQI-S3D42" />
      <accept Dvendor="Infineon:7" Dname="CYB06447BZI-BLD53" />
      <accept Dvendor="Infineon:7" Dname="CYB06447BZI-BLD54" />
      <accept Dvendor="Infineon:7" Dname="CYB06447BZI-D54" />
      <accept Dvendor="Infineon:7" Dname="CYB0644ABZI-S2D44" />
      <accept Dvendor="Infineon:7" Dname="CYS0644ABZI-S2D44" />
    </condition>
    <condition id="PSoC 4500H">
      <description>PSoC 4500H devices</description>
      <accept Dvendor="Infineon:7" Dname="CY8C4588AZI-H675" />
      <accept Dvendor="Infineon:7" Dname="CY8C4588AZI-H676" />
      <accept Dvendor="Infineon:7" Dname="CY8C4588AZI-H685" />
      <accept Dvendor="Infineon:7" Dname="CY8C4588AZI-H686" />
      <accept Dvendor="Infineon:7" Dname="CY8C4588AZQ-H685" />
      <accept Dvendor="Infineon:7" Dname="CY8C4588AZQ-H686" />
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PSoC 6">
      <!-- This is a dummy startup implementation that emits a compiler error once
           this software component is enabled in the CMSIS RTE project configuration.
           It exists to silence PackChk WARNING M350: No 'Startup' component found.
           Refer to README.txt in the pack root directory for the guidance on the
           intended use of this CSMIS pack. -->
      <description>Dummy startup component, do not use</description>
      <files>
        <file category="doc" name="README.txt" />
        <file category="source" name="Device/Source/startup_error.c" version="1.0.0" />
      </files>
    </component>
  </components>
</package>